# Employee Attrition Rate: Attrition Data

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv(r"E:\Kaggle DB\Extracted\Employee attrition rate\Attrition Data.csv")

In [6]:
df.head(6)

,Age,Attrition,Department,DistanceFromHome,Education,EducationField,EnvironmentSatisfaction,JobSatisfaction,MaritalStatus,MonthlyIncome,NumCompaniesWorked,WorkLifeBalance,YearsAtCompany
0,41,Yes,Sales,1,2,Life Sciences,2,4,Single,5993,8,1,6
1,49,No,Research & Development,8,1,Life Sciences,3,2,Married,5130,1,3,10
2,37,Yes,Research & Development,2,2,Other,4,3,Single,2090,6,3,0
3,33,No,Research & Development,3,4,Life Sciences,4,3,Married,2909,1,3,8
4,27,No,Research & Development,2,1,Medical,1,2,Married,3468,9,3,2
5,32,No,Research & Development,2,2,Life Sciences,4,4,Single,3068,0,2,7

# Column DataSet

In [7]:
df.columns

Index(['Age', 'Attrition', 'Department', 'DistanceFromHome', 'Education',
       'EducationField', 'EnvironmentSatisfaction', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'NumCompaniesWorked',
       'WorkLifeBalance', 'YearsAtCompany'],
      dtype='object')

In [8]:
df.Department

0                        Sales
1       Research & Development
2       Research & Development
3       Research & Development
4       Research & Development
                 ...
1465    Research & Development
1466    Research & Development
1467    Research & Development
1468                     Sales
1469    Research & Development
Name: Department, Length: 1470, dtype: object

#### Attrition of Employee from Research and development environment

In [9]:
Attrition_age = df.Age.between(25,35)
Attrition_Department = df.Department == "Research & Development"
Monthly_income  = df.MonthlyIncome.between(3000, 5000)

employee_attrition = df.loc[Attrition_age & Attrition_Department & Monthly_income, ['MaritalStatus','Age']]
employee_attrition

     MaritalStatus  Age
4          Married   27
5           Single   32
11          Single   29
16        Divorced   32
26          Single   32
...            ...  ...
1425       Married   33
1442       Married   29
1459       Married   29
1460        Single   29
1469       Married   34

[124 rows x 2 columns]

In [10]:
value = df['EducationField'].values


value

array(['Life Sciences', 'Life Sciences', 'Other', ..., 'Life Sciences',
       'Medical', 'Medical'], dtype=object)

#### Attrition of Employees based on Life Sciences(Education Field) and Sales as Attrition Department

In [11]:
#Attrition_age = df.Age.between(25,35)
Education_Field = df.EducationField == 'Life Sciences'
#Monthly_income  = df.MonthlyIncome.between(3000, 5000)
Attrition_Department = df.Department == "Sales"


Attrition_of_employee_based_on_Education_field = df.loc[Education_Field   & Attrition_Department, ['Department','Attrition','DistanceFromHome']]

In [14]:
Attrition_of_employee_based_on_Education_field.head(50)

    Department Attrition  DistanceFromHome
0        Sales       Yes                 1
18       Sales        No                 2
21       Sales       Yes                 9
39       Sales        No                 1
43       Sales        No                 8
56       Sales        No                18
63       Sales        No                25
70       Sales        No                 1
82       Sales        No                 1
115      Sales        No                 3
119      Sales        No                26
124      Sales       Yes                 6
132      Sales       Yes                20
133      Sales        No                 9
137      Sales        No                 4
138      Sales        No                28
167      Sales        No                 5
168      Sales        No                 1
174      Sales        No                 4
212      Sales        No                20
215      Sales        No                 6
223      Sales        No                 3
237      Sales        No                 2
238      Sales        No                 4
261      Sales        No                 2
281      Sales        No                 1
282      Sales        No                 2
300      Sales        No                 2
306      Sales        No                 7
320      Sales        No                 2
349      Sales        No                 2
355      Sales        No                 1
370      Sales       Yes                12
374      Sales        No                 9
376      Sales        No                14
397      Sales        No                 4
401      Sales        No                 6
417      Sales        No                 2
445      Sales        No                18
446      Sales        No                10
450      Sales        No                 2
456      Sales        No                 7
462      Sales        No                21
466      Sales        No                 2
480      Sales       Yes                12
504      Sales       Yes                26
517      Sales        No                 8
525      Sales       Yes                 3
533      Sales        No                 5
546      Sales        No                10